In [1]:
import pandas as pd
import pymssql
import pymysql
import sys
import hashlib
from datetime import datetime
sys.path.append('/Users/yuming/Github/helios/helios/app')

CONN_FUNC = {'mysql': pymysql.connect, 'mssql': pymssql.connect}

SERVER = {'mysql': {'ip': '192.168.7.74',
                    'username': 'root',
                    'pwd': 'Helios123',
                    'port': 3306},
          'mssql': {'ip': '192.168.7.155',
                    'username': 'SA',
                    'pwd': 'Helios123',
                    'port': 1433}
          }

sql = 'mssql'
dbname = 'hr_pii'
conn = CONN_FUNC.get(sql)(server=SERVER[sql]['ip'], user=SERVER[sql]['username'], password=SERVER[sql]['pwd'], database=dbname)

df = pd.read_sql('SELECT ssn, birthdate FROM employee', con=conn)

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [2]:
df.head()

           ssn   birthdate
0  001-82-8525  1992-04-17
1  005-25-2021  1954-11-24
2  005-32-4497  1961-09-28
3  007-41-2966  1977-01-03
4  010-99-5324  1992-09-13

In [3]:
datetime.strptime('1992-04-17', '%Y-%m-%d')

datetime.datetime(1992, 4, 17, 0, 0)

In [4]:
datetime.strptime('1992-04-17', '%Y-%m-%d').strftime('%m/%d/%Y')

'04/17/1992'

In [5]:
df['birthday'] = df['birthdate'].map(lambda x: datetime.strptime(x, '%Y-%m-%d').strftime('%m/%d/%Y'))

In [6]:
result = df.drop('birthdate', axis=1)
result.head()

           ssn    birthday
0  001-82-8525  04/17/1992
1  005-25-2021  11/24/1954
2  005-32-4497  09/28/1961
3  007-41-2966  01/03/1977
4  010-99-5324  09/13/1992

In [13]:
from sqlalchemy import create_engine
engine = create_engine('mssql+pymssql://SA:Helios123@192.168.7.155:1433/hr_pii')
con = engine.raw_connection()

In [11]:
employee = pd.read_sql('SELECT * FROM employee', con=con)
# employee.to_csv('employee_backup.csv')
employee.head()

,ssn,blood_group,name,sex,mail,phone,race,ethnic,religion,trade_union,health,sexual,politics,birthdate
0,001-82-8525,AB+,Wayne Jones,M,juliakaufman@hotmail.com,(802)111-7264,White,Hispanic or Latino or Spanish Origin,Caodaism,None,Disabled,Homosexual,None,1992-04-17
1,005-25-2021,AB+,Christopher Burgess,M,hallerika@gmail.com,(731)673-6998,None,None,None,None,None,None,None,1954-11-24
2,005-32-4497,AB+,Yvette Ramsey,F,fdurham@hotmail.com,(731)305-6279,None,None,None,None,None,None,None,1961-09-28
3,007-41-2966,B+,John Frank,M,christine44@hotmail.com,(215)986-2896,White,Hispanic or Latino or Spanish Origin,None,False,None,Asexual,Democratic Party,1977-01-03
4,010-99-5324,B-,Heather Rogers,F,rthomas@hotmail.com,(405)889-4448,None,None,None,None,None,None,None,1992-09-13

In [15]:
result.to_sql('employee_new', index=False, con=cone)
test = pd.read_sql('SELECT * FROM employee_new', con=con)
test.head()

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': 'params' arg (<class 'list'>) can be only a tuple or a dictionary.

In [25]:
c = con.cursor()
for row in result.itertuples():
    query = "INSERT INTO employee_new (ssn, birthday) VALUES ('%s', '%s')" % (row[1], row[2])
#     print(query)
    c.execute(query)
    con.commit()